Revit 2027 API
DuctSizes.Contains Method
 Checks whether a duct size with the nominal diameter exists.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	double nominalDiameter
)
Public Function Contains (
	nominalDiameter As Double
) As Boolean
public:
bool Contains(
	double nominalDiameter
)
member Contains :
        nominalDiameter : float -> bool
Parameters
nominalDiameter Double
 Nominal diameter.
Return Value
Boolean
 True if a duct size with the nominal diameter exists.
See Also
Reference
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace